---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.RotationalPointSpringCoefficient
source: html/1b5bca46-3a87-5c13-7e49-f1d2524548a0.htm
---
# Autodesk.Revit.DB.SpecTypeId.RotationalPointSpringCoefficient Property

Rotational Point Spring Coefficient, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId RotationalPointSpringCoefficient { get; }
```